<template>
  <div class="delivery container">
    <h2 class="delivery__title">
      Доставка и оплата
    </h2>
    <div class="delivery__text">
      Оплата на нашем сайте возможна банковской картой, через Интернет.
      <br/>
      Оплата банковскими картами осуществляется через АО «Тинькофф банк»
      <br/>
      Мы принимаем платежи с сайта по следующим банковским картам: VISA, MASTERCARD, МИР
    </div>
    <ul class="delivery__list">
      Как оплатить картой?
      <li class="delivery__item">
        После поступления оплаты отгрузка осуществляется в течение 1-2 рабочих дней (не учитывая день оплаты заказа);
      </li>
      <li class="delivery__item">
        Номер трека или товарно-транспортной накладной посылки будет добавлен в личный кабинет и отправлен в смс-оповещении и на e-mail в течение 2-х дней после отправки;
      </li>
      <li class="delivery__item">
        Ответственность за сохранность заказа во время пересылки несет транспортная компания, служба доставки ЕМС и Почта России. При получении заказа обя зательно проверяйте целостность упаковки;
      </li>
      <li class="delivery__item">
        Согласно Закону "О защите прав потребителей" и "Правилам дистанционной продажи" при отказе покупателя от получения товара, он обязан оплатить продавцу стоимость доставки.
      </li>
      <li class="delivery___item">
        Интернет-магазин «Brume» оставляет за собой право выбора транспортной компании самостоятельно
      </li>
    </ul>
    <div class="delivery__text">
      К оплате принимаются банковские карты, у которых 16, 18, 19 цифр в номере:
      <br/>
      ООО «Медпоиск.Ком» просит Вас сохранять все копии документов, подтверждающие совершенные транзакции по оплате товара.
    </div>
    <ul class="delivery__list">
      Как оплатить картой?
      <li class="delivery__item">
        банковская карта не предназначена для совершения платежей через интернет, о чем можно узнать, обратившись в Ваш Банк;
      </li>
      <li class="delivery__item">
        недостаточно средств для оплаты на банковской карте. Подробнее о наличии средств на банковской карте Вы можете узнать, обратившись в банк, выпустивший банковскую карту;
      </li>
      <li class="delivery__item">
        данные банковской карты введены неверно;
      </li>
      <li class="delivery__item">
        истек срок действия банковской карты. Срок действия карты, как правило, указан на лицевой стороне карты (это месяц и год, до которого действительна карта). Подробнее о сроке действия карты Вы можете узнать, обратившись в банк, выпустивший банковскую карту;
      </li>
    </ul>
    <ul class="delivery__list">
      Стоимость и сроки доставки
      <li class="delivery__item">
        Почта России и ЕМС <a href="https://www.pochta.ru/parcels" class="delivery__link">
          (калькулятор)</a>
      </li>
      <li class="delivery__item">
        СДЭК <a href="https://www.pochta.ru/parcels" class="delivery__link">
          (калькулятор)
        </a>
      </li>
    </ul>
    <div class="delivery__text">
      Возврат денежных средств осуществляется согласно законодательству Российской Федерации.
    </div>
  </div>
</template>

<script>
export default {

}
</script>

<style lang="scss" scoped>
.delivery {
  margin-top: 200px;

  &__title {
    width: 100%;
    text-align: center;
    font-size: 30px;
    font-weight: 700;
    margin-bottom: 30px;
  }

  &__text {
    font-size: 20px;
  }

  &__list {
    font-size: 20px;
    margin: 15px 0 30px 0;
  }

  &__item {
    font-size: 18px;
    margin: 20px;
    list-style: disc;
  }

  &__link {
    margin-left: 20px;
  }
}
</style>
